In [10]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a','a','b','b','a'],
               'key2':['one','two','one','two','one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)
               })

In [11]:
df

  key1 key2     data1     data2
0    a  one  1.745622 -0.831466
1    a  two  1.181316 -0.132075
2    b  one -0.245687  0.892473
3    b  two  0.327837  0.258863
4    a  one -0.998713 -0.052820

In [7]:
import matplotlib.pyplot as plt
%matplotlib inline

In [12]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [13]:
grouped.mean()

key1
a    0.642742
b    0.041075
Name: data1, dtype: float64

In [14]:
grouped.sum()

key1
a    1.928225
b    0.082150
Name: data1, dtype: float64

In [16]:
df.groupby(df['key1']).sum()

         data1     data2
key1
a     1.928225 -1.016361
b     0.082150  1.151335

In [18]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [19]:
means

key1  key2
a     one     0.373455
      two     1.181316
b     one    -0.245687
      two     0.327837
Name: data1, dtype: float64

In [21]:
df.groupby('key1')[['data2']].mean()

         data2
key1
a    -0.338787
b     0.575668

In [22]:
type(df.groupby('key1')[['data2']].mean())

pandas.core.frame.DataFrame

In [23]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                      index=['Joe','Steve','Wes','Jim','Travis']
                     )
people

               a         b         c         d         e
Joe     0.179117  0.035844  0.055345  0.164161  0.621433
Steve  -1.975903  0.474265 -0.999731 -0.236838  1.482994
Wes     0.006212 -1.384824 -0.608777 -0.203917 -0.470571
Jim    -0.475978  0.365386 -0.082519 -0.674401 -0.486255
Travis  0.389280 -0.912011 -1.199587 -0.291984 -1.312623

In [25]:
people.iloc[2:3,[1,2]] = np.nan

In [26]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [27]:
by_column = people.groupby(mapping, axis=1)

In [28]:
by_column.sum()

            blue       red
Joe     0.219506  0.836394
Steve  -1.236570 -0.018644
Wes    -0.203917 -0.464359
Jim    -0.756920 -0.596847
Travis -1.491571 -1.835355

In [29]:
map_series = pd.Series(mapping)

In [30]:
type(map_series)

pandas.core.series.Series

In [31]:
people.groupby(map_series, axis=1)